tap "homebrew/bundle"
tap "homebrew/cask-versions"
# Mac App Store command-line interface
brew "mas"
# Intelligent cloud storage platform
cask "adrive"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D creation suite
cask "blender"
# Free and open-source web browser
cask "chromium"
# Universal database tool and SQL client
cask "dbeaver-community"
# Replacement for Docker Desktop
cask "orbstack"
# Matrix collaboration client
cask "element"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free and open-source media player
cask "kodi"
# Software for Logitech devices
cask "logi-options+"
# Digital logic designer and simulator
cask "logisim-evolution"
# Trims video and audio files losslessly
cask "losslesscut"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office-2019"
# Remote desktop client
cask "microsoft-remote-desktop"
# Music streaming platform
cask "neteasemusic"
# Cloud storage service platform
cask "nutstore"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Remote desktop
cask "parsec"
# Sideload iOS apps and games
cask "playcover-community"
# Collaboration platform for API development
cask "postman"
# IDE for application development
cask "qt-creator"
# Control your tools with a few keystrokes
cask "raycast"
# Snip or pin screenshots
cask "snipaste"
# Video game digital distribution service
cask "steam"
# App to switch hosts
cask "switchhosts"
# Terminal emulator, SSH and serial client
cask "tabby"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# VPN and WiFi proxy
cask "thunder"
# Platform for 3D content
cask "unity"
# Management tool for Unity
cask "unity-hub"
# Virtual machines UI using QEMU
cask "utm"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Free messaging and calling application
cask "wechat"
# Multiplayer code editor
cask "zed"
# Mesh VPN client
cask "zerotier-one"
mas "Microsoft To Do", id: 1274495053
mas "VidHub", id: 1659622164
