tap "homebrew/bundle"
# Intelligent cloud storage platform
cask "adrive"
# Universal database tool and SQL client
cask "dbeaver-community"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free and open-source media player
cask "kodi"
# Trims video and audio files losslessly
cask "losslesscut"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Remote desktop client
cask "microsoft-remote-desktop"
# Music streaming platform
cask "neteasemusic"
# Cloud storage service platform
cask "nutstore"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Remote desktop
cask "parsec"
# Sideload iOS apps and games
cask "playcover-community"
# Collaboration platform for API development
cask "postman"
# Instant messaging tool
cask "qq"
# Snip or pin screenshots
cask "snipaste"
# Video game digital distribution service
cask "steam"
# App to switch hosts
cask "switchhosts"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# VPN and WiFi proxy
cask "thunder"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Mesh VPN client
cask "zerotier-one"
vscode "bbenoist.Nix"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "GitHub.codespaces"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "mintlify.document"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "mutantdino.resourcemonitor"
vscode "peterj.proto"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "Shopify.ruby-lsp"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
